// 地形生成系统
// 1.基本方块生成 完成
// 2.方块结构生成 部分完成-未验证
// 3.单方块编辑 完成
// 4.方块结构编辑 未完成 
// 5.非方块实体放置 未完成
// 6.非方块实体交互 未完成
// 7.战斗地形随机生成 完成-未验证
// 8.地形保存重载 完成
// 优化部分
// GPU生成 未完成

// 房间系统 ？ecs
// 1.房间数据结构 部分完成-未验证
// 2.房间生成算法 未完成
// 3.房间门交互 未完成
// 4.根据NPC类型限制进入区域 未完成
// 5.房间数据保存 未完成

// 寻路系统 ？ecs
// 室外-流场寻路
// 1.流场寻路数据生成 部分完成-未验证
// 2.根据生物类型目标选择不同流场图 未完成
// 3.流场数据保存 未完成
// 室内-未确定？流场寻路（由于地形可编辑，生成频繁），？B*（衔接复杂）

// NPC及怪物逻辑部分 ？ecs
// 1.NPC及怪物数据结构设计 未完成
// 2.行为树 插件未验证
// 3.NPC模型变化 未完成
// 4.NPC好感系统 未确定
// 5.关键NPC房间绑定 未完成

//店铺部分
// 1.玩家店铺编辑 未完成
// 2.员工系统 未确定
// 3.街道管理 未完成
// 4.NPC房间生成 未完成
// 5.关联游客需求 未完成

// 玩家部分
// 1.建造交互 部分完成
// 2.数据结构 未确定
// 3.角色创建 未完成
// 4.技能及等级系统 未完成
// 5.试菜系统 未确定

// 杂项
// 1.时间 未完成
// 2.商店系统 未确定
// 3.
